# 문제 1. 데이터 가져오기 
- titanic_train.csv 파일과 titanic_test.csv 파일을 불러오세요
- train, test로 저장하기

In [63]:
import pandas as pd

train = pd.read_csv("data/titanic_train.csv")
test = pd.read_csv("data/titanic_test.csv")

train.shape, test.shape

((891, 12), (418, 11))

# 문제 2. loc 활용
- Passenger ID가 9인 승객 정보 가져오기
- loc문법만 활용

In [64]:
test.loc[8]

PassengerId                                          900
Pclass                                                 3
Name           Abrahim, Mrs. Joseph (Sophie Halaut Easu)
Sex                                               female
Age                                                 18.0
SibSp                                                  0
Parch                                                  0
Ticket                                              2657
Fare                                              7.2292
Cabin                                                NaN
Embarked                                               C
Name: 8, dtype: object

In [65]:
train.head(1)

   PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
0            1         0       3  ...  7.25   NaN         S

[1 rows x 12 columns]

In [66]:
test.head(1)

   PassengerId  Pclass              Name   Sex  ...  Ticket    Fare  Cabin Embarked
0          892       3  Kelly, Mr. James  male  ...  330911  7.8292    NaN        Q

[1 rows x 11 columns]

In [67]:
user_train = train.loc[train['PassengerId'] == 9, :].reset_index(drop = True)
user_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1 entries, 0 to 0
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1 non-null      int64
 1   Survived     1 non-null      int64
 2   Pclass       1 non-null      int64
 3   Name         1 non-null      object
 4   Sex          1 non-null      object
 5   Age          1 non-null      float64
 6   SibSp        1 non-null      int64
 7   Parch        1 non-null      int64
 8   Ticket       1 non-null      object
 9   Fare         1 non-null      float64
 10  Cabin        0 non-null      object
 11  Embarked     1 non-null      object
dtypes: float64(2), int64(5), object(5)
memory usage: 228.0+ bytes

In [68]:
# 코드

# 문제 3. loc 활용
- Passenger ID가 1-10사이에서 짝수 ID만 가져오기 (슬라이싱만 활용)
- 특정 컬럼만 조회 : PassengerId, Survived, Sex, Fare, Embarked
- loc문법만 활용

In [69]:
user_test.head(1)

Empty DataFrame
Columns: [PassengerId, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [70]:
user_train.head(1)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            9         1       3  ...  11.1333   NaN         S

[1 rows x 12 columns]

In [ ]:
user_train = train.loc[(train['PassengerId'] <= 10) & (train['PassengerId'] >= 1), ['PassengerId', 'Survived', 'Sex', 'Fare','Embarked']].reset_index(drop = True)
user_test = test.loc[(test['PassengerId'] <= 10) & (test['PassengerId'] >= 1), ['PassengerId', 'Survived', 'Sex', 'Fare','Embarked']].reset_index(drop = True)
user_train, user_test

In [72]:
train.loc[1:9:2, ['PassengerId', 'Survived', 'Sex', 'Fare','Embarked']]

   PassengerId  Survived     Sex     Fare Embarked
1            2         1  female  71.2833        C
3            4         1  female  53.1000        S
5            6         0    male   8.4583        Q
7            8         0    male  21.0750        S
9           10         1  female  30.0708        C

# 문제 4. GroupBy 연산
- 아래와 같이 pivot Table 구현한 것을 Group By 연산으로 적용할 것

In [4]:
train.pivot_table(index='Sex', columns='Pclass', values='Fare', aggfunc='mean')

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [38]:
train_group = train.groupby(['Sex','Pclass'], observed = True)['Fare'].mean()
train_group.unstack()

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

In [5]:
# 코드

Pclass           1          2          3
Sex
female  106.125798  21.970121  16.118810
male     67.226127  19.741782  12.661633

# 문제 5 Join문제
- members.csv와 orders.csv 파일 확인
    + members.csv : 회원정보 
    + orders.csv : 주문정보 
- 성별, 연령별 평균금액 구하기
- 주의) CSV 파일 열어보지 말기

In [73]:
import pandas as pd

member = pd.read_csv("data/members.csv")
order = pd.read_csv("data/orders.csv")

print(f"Members columns: {member.head(1)}")
print(f"Orders columns: {order.head(1)}")

Members columns:    회원ID  회원명  나이 성별
0  1001  김철수  25  M
Orders columns:    주문ID  회원ID   주문금액        주문일자
0     1  1001  33342  2024-01-01

In [75]:
order.head(1)

   주문ID  회원ID   주문금액        주문일자
0     1  1001  33342  2024-01-01

In [76]:
# join을 위해 key값 찾기
# key값 찾기 위해 colums 확인
print(f"members columns: {member.columns}")
print(f"orders columns: {order.columns}")

members columns: Index(['회원ID', '회원명', '나이', '성별'], dtype='object')
orders columns: Index(['주문ID', '회원ID', '주문금액', '주문일자'], dtype='object')

In [81]:
# join할 공통 컬럼 찾기 (위 결과에서)
# merge 사용해봄

# 주요 포인트는 주문임
# '주문을 한'
df = pd.merge(member, order, on = '회원ID', how = 'inner')
df.head(1)

result = df.groupby(['성별','나이'])['주문금액'].mean()
result

성별  나이
F   27    40774.500000
    29    71044.666667
    32    39754.000000
    35    45776.500000
M   25    50155.000000
    28    94127.500000
    31    84481.000000
    42    52919.000000
    45    65578.500000
Name: 주문금액, dtype: float64

In [80]:
df = pd.merge(member, order, on = '회원ID', how = 'left')
df.head(1)

   회원ID  회원명  나이 성별  주문ID     주문금액        주문일자
0  1001  김철수  25  M   1.0  33342.0  2024-01-01